import pickle
from sklearn.linear_model import LinearRegression

# 假設我們有一些房屋價格和對應的特徵數據
X = [[1000], [1500], [2000], [2500], [3000], [3500], [4000], [4500], [5000], [5500], [6000], [6500], [7000], [7500], [8000], [8500], [9000], [9500], [10000], [10500]]
y = [50000, 75000, 100000, 125000, 150000, 175000, 200000, 225000, 250000, 275000, 300000, 325000, 350000, 375000, 400000, 425000, 450000, 475000, 500000, 525000]

# 建立並訓練線性回歸模型
model = LinearRegression()
model.fit(X, y)

# 保存模型的狀態到 pickle 檔案
with open('linear_regression_model.pkl', 'wb') as f:
        pickle.dump(model, f)
